Tekla.Structures.Model.TransformationPlane
The TransformationPlane class describes a transformation from global model coordinates
to local and back to global.
The following example shows how to use transformation planes for transforming points:
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Model myModel = new Model();
WorkPlaneHandler myWorkPlaneHandler = myModel.GetWorkPlaneHandler();
Beam myBeam = new Beam();
Point Point1 = new Point(1000, 1000, 1000);
Point Point2 = new Point(2000, 3000, 1000);
myBeam.Profile.ProfileString = "400X400";
myBeam.Insert();
myModel.CommitChanges();
TransformationPlane currentPlane = myWorkPlaneHandler.GetCurrentTransformationPlane();
TransformationPlane beamPlane = new TransformationPlane(myBeam.GetCoordinateSystem());
Point lPoint1 = beamPlane.TransformationMatrixToLocal.Transform(currentPlane.TransformationMatrixToGlobal.Transform(Point1));
Point lPoint2 = beamPlane.TransformationMatrixToLocal.Transform(currentPlane.TransformationMatrixToGlobal.Transform(Point2));
}
}

Tekla.Structures.Model.TransformationPlane.#ctor
Creates a new identity transformation using the global coordinate system.

Tekla.Structures.Model.TransformationPlane.#ctor(Tekla.Structures.Geometry3d.CoordinateSystem)
Creates a new transformation plane defined by the given coordinate system.
CoordinateSystem: The coordinate system to be used.

Tekla.Structures.Model.TransformationPlane.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Creates a new transformation plane defined by the given origin and two vectors.
Origo: The origin to be used.
Xvector: The X vector to be used.
Yvector: The Y vector to be used.

Tekla.Structures.Model.TransformationPlane.TransformationMatrixToGlobal
Gives a transformation matrix for converting local points in the transformation plane to global coordinates.

Tekla.Structures.Model.TransformationPlane.TransformationMatrixToLocal
Gives a transformation matrix for converting points in the global plane to local coordinates in the transformation plane.

Tekla.Structures.Model.TransformationPlane.ToString
Returns a string representation of the matrices that transform to local and global coordinates.
Returns: A string representation of the matrices that transform to local and global coordinates.